src/Catalogs/Roles_AccessRoles/Roles_AccessRoles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Roles_AccessRoles</name>
  <basedOn>Catalog.Roles_AccessProfiles</basedOn>
  <basedOn>Catalog.Users</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>SetRightsForNewNativeObjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SetRightsForAttributesAndTabularSectionsByDefault</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SubordinateObjectsHaveIndependentRights</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ConfigRoles</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Configuration</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>ObjectType</name>
      <type>
        <types>EnumRef.Roles_MetadataTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightName</name>
      <type>
        <types>EnumRef.Roles_Rights</types>
      </type>
    </attributes>
    <attributes>
      <name>RowID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ObjectPath</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightValue</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Disable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectSubtype</name>
      <type>
        <types>EnumRef.Roles_MetadataSubtype</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RestrictionByCondition</name>
    <attributes>
      <name>RowID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Fields</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>FilterDataStorage</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Templates</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Template</name>
      <type>
        <types>CatalogRef.Roles_Templates</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>LangInfo</name>
    <attributes>
      <name>LangCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>LangDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Roles_Parameters/Roles_Parameters.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Roles_Parameters</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ValuesData</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>isList</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ValuesListData</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ValueTypeData</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Roles_AccessRoles/Forms/EditCondition/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ThisObject.Path = Parameters.Path;
	
	DCSTemplate = GetCommonTemplate("Roles_DCS");
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	Roles_Parameters.Ref AS Ref,
		|	Roles_Parameters.Description AS Description,
		|	Roles_Parameters.ValuesData AS ValuesData,
		|	Roles_Parameters.isList AS isList,
		|	Roles_Parameters.ValuesListData AS ValuesListData,
		|	Roles_Parameters.ValueTypeData AS ValueTypeData
		|FROM
		|	Catalog.Roles_Parameters AS Roles_Parameters";
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	While SelectionDetailRecords.Next() Do
		NewParam = DCSTemplate.Parameters.Add();
		NewParam.Name = SelectionDetailRecords.Description;
		NewParam.ValueType = SelectionDetailRecords.ValueTypeData.Get();
	EndDo;
	
	



	
	DataSet = DCSTemplate.DataSets[0];
	DataSet.Query = (
	"SELECT *
	|FROM
	|    " + Path + " AS DataSet"
	);
	
	Address = PutToTempStorage(DCSTemplate, UUID);
	ThisObject.SettingsComposer.Initialize(New DataCompositionAvailableSettingsSource(Address));
	
	//If Parameters.SavedSettings = Undefined Then
		ThisObject.SettingsComposer.LoadSettings(DCSTemplate.DefaultSettings);
	//Else
	//	ThisObject.SettingsComposer.LoadSettings(Parameters.SavedSettings);
	//EndIf;
	SettingsComposer.Settings.Selection.Items.Clear();
	For Each Field In SettingsComposer.Settings.Selection.SelectionAvailableFields.Items Do
		If Field.Folder Then
			Continue;
		EndIf;
		Selection = SettingsComposer.Settings.Selection.Items.Add(Type("DataCompositionSelectedField"));
		Selection.Use = True;
		Selection.Field = Field.Field; 
	EndDo;
	
EndProcedure

&AtClient
Procedure Cancel(Command)
	Close(Undefined);
EndProcedure

&AtClient
Procedure Ok(Command)
	Close(PrepareResult());
EndProcedure

&AtServer
Function PrepareResult()
	Settings = ThisObject.SettingsComposer.GetSettings();
	DataCompositionSchema = GetFromTempStorage(Address);
	Composer = New DataCompositionTemplateComposer();
	Tempalte = Composer.Execute(DataCompositionSchema, Settings, , ,
		Type("DataCompositionValueCollectionTemplateGenerator"));

	//QuerySchema = New QuerySchema;
	//QuerySchema.SetQueryText(Tempalte.DataSets.DataSet.Query);
	//QuerySchema.QueryBatch[0].Operators[0].Filter.Add(Tempalte.DataSets.DataSet.Filter);
	//
	//For Each Filter In QuerySchema.QueryBatch[0].Operators[0].Filter Do
	//	Message(Filter);
	//EndDo;
	//
	
	
	Result = New Structure();
	Result.Insert("Settings", Settings);
	Result.Insert("Query", Tempalte.DataSets.DataSet.Query);
	Return Result;
EndFunction
